src/res/wrk2profile3.txt
Running 2m test @ http://localhost:8080
  4 threads and 400 connections
  Thread calibration: mean lat.: 4.611ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 4.515ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.976ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.592ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    65.41ms  187.53ms   1.30s    90.33%
    Req/Sec    15.47k     2.99k   44.67k    77.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.97ms
 75.000%    7.36ms
 90.000%  231.04ms
 99.000%  925.70ms
 99.900%    1.16s 
 99.990%    1.25s 
 99.999%    1.29s 
100.000%    1.30s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.055     0.000000            1         1.00
       1.121     0.100000       657634         1.11
       1.551     0.200000      1315145         1.25
       1.921     0.300000      1971292         1.43
       2.335     0.400000      2630702         1.67
       2.967     0.500000      3285620         2.00
       3.517     0.550000      3614350         2.22
       4.315     0.600000      3942766         2.50
       5.195     0.650000      4271456         2.86
       6.123     0.700000      4599043         3.33
       7.355     0.750000      4928055         4.00
       8.183     0.775000      5092286         4.44
       9.175     0.800000      5257065         5.00
      10.463     0.825000      5420731         5.71
      12.943     0.850000      5584719         6.67
      78.719     0.875000      5748736         8.00
     155.775     0.887500      5830915         8.89
     231.039     0.900000      5912972        10.00
     316.159     0.912500      5995287        11.43
     394.751     0.925000      6077360        13.33
     462.847     0.937500      6159299        16.00
     500.991     0.943750      6200542        17.78
     542.719     0.950000      6241601        20.00
     585.215     0.956250      6282643        22.86
     626.687     0.962500      6323628        26.67
     668.159     0.968750      6364970        32.00
     692.735     0.971875      6385144        35.56
     724.479     0.975000      6405754        40.00
     764.415     0.978125      6426290        45.71
     802.303     0.981250      6446957        53.33
     839.679     0.984375      6467284        64.00
     861.183     0.985938      6477729        71.11
     884.223     0.987500      6487814        80.00
     910.847     0.989062      6498208        91.43
     934.911     0.990625      6508435       106.67
     959.487     0.992188      6518631       128.00
     973.311     0.992969      6523846       142.22
     988.159     0.993750      6528877       160.00
    1005.055     0.994531      6534085       182.86
    1022.463     0.995313      6539146       213.33
    1040.895     0.996094      6544353       256.00
    1050.623     0.996484      6546927       284.44
    1061.887     0.996875      6549410       320.00
    1075.199     0.997266      6552130       365.71
    1089.535     0.997656      6554635       426.67
    1105.919     0.998047      6557144       512.00
    1116.159     0.998242      6558480       568.89
    1126.399     0.998437      6559694       640.00
    1136.639     0.998633      6560935       731.43
    1149.951     0.998828      6562273       853.33
    1165.311     0.999023      6563526      1024.00
    1174.527     0.999121      6564209      1137.78
    1183.743     0.999219      6564842      1280.00
    1191.935     0.999316      6565523      1462.86
    1199.103     0.999414      6566082      1706.67
    1206.271     0.999512      6566713      2048.00
    1210.367     0.999561      6567074      2275.56
    1214.463     0.999609      6567352      2560.00
    1219.583     0.999658      6567686      2925.71
    1224.703     0.999707      6568016      3413.33
    1229.823     0.999756      6568344      4096.00
    1232.895     0.999780      6568495      4551.11
    1236.991     0.999805      6568662      5120.00
    1240.063     0.999829      6568792      5851.43
    1244.159     0.999854      6568992      6826.67
    1248.255     0.999878      6569152      8192.00
    1250.303     0.999890      6569224      9102.22
    1253.375     0.999902      6569295     10240.00
    1256.447     0.999915      6569368     11702.86
    1259.519     0.999927      6569436     13653.33
    1262.591     0.999939      6569518     16384.00
    1264.639     0.999945      6569561     18204.44
    1266.687     0.999951      6569599     20480.00
    1268.735     0.999957      6569643     23405.71
    1270.783     0.999963      6569679     27306.67
    1274.879     0.999969      6569729     32768.00
    1275.903     0.999973      6569740     36408.89
    1276.927     0.999976      6569760     40960.00
    1278.975     0.999979      6569781     46811.43
    1281.023     0.999982      6569797     54613.33
    1283.071     0.999985      6569818     65536.00
    1284.095     0.999986      6569826     72817.78
    1285.119     0.999988      6569834     81920.00
    1287.167     0.999989      6569847     93622.86
    1289.215     0.999991      6569861    109226.67
    1290.239     0.999992      6569866    131072.00
    1291.263     0.999993      6569872    145635.56
    1292.287     0.999994      6569876    163840.00
    1294.335     0.999995      6569884    187245.71
    1294.335     0.999995      6569884    218453.33
    1296.383     0.999996      6569893    262144.00
    1296.383     0.999997      6569893    291271.11
    1296.383     0.999997      6569893    327680.00
    1297.407     0.999997      6569896    374491.43
    1298.431     0.999998      6569901    436906.67
    1298.431     0.999998      6569901    524288.00
    1299.455     0.999998      6569902    582542.22
    1300.479     0.999998      6569906    655360.00
    1300.479     0.999999      6569906    748982.86
    1300.479     0.999999      6569906    873813.33
    1301.503     0.999999      6569909   1048576.00
    1301.503     0.999999      6569909   1165084.44
    1301.503     0.999999      6569909   1310720.00
    1301.503     0.999999      6569909   1497965.71
    1302.527     0.999999      6569911   1747626.67
    1302.527     1.000000      6569911   2097152.00
    1302.527     1.000000      6569911   2330168.89
    1302.527     1.000000      6569911   2621440.00
    1302.527     1.000000      6569911   2995931.43
    1303.551     1.000000      6569913   3495253.33
    1303.551     1.000000      6569913          inf
#[Mean    =       65.405, StdDeviation   =      187.531]
#[Max     =     1302.528, Total count    =      6569913]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7150716 requests in 2.00m, 566.03MB read
Requests/sec:  59590.50
Transfer/sec:      4.72MB